"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
user_age = 28
user_name = "Ігор"
student_status = True
"""

**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
user_name = "John" # використання числівника до назви змінної
user_age = 25  # використання - а не _
price = 100 # використання символу валюти в назві змінної
class_name = "Math" # термін class не може бути використаним в ролі назви змінної
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
max_students = 30

"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
course_name = "History"
course_length = 140
course_price = 15000.00

"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
cost_efficiency = course_length / course_price
print (cost_efficiency, " - вартість за годину")

"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
base_10 = 42
base_2 = 0b101010
base_16 = 0x2A
base_8 = 0o52
print (base_10, base_16, base_2, base_8)
"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
addition = 17 + 5
subtraction = 17 - 5
multiplication = 17 * 5
division = 17 / 5
floor_division = 17 // 5
remainder = 17 % 5
exponent = 17 ** 5
print (addition, "+ додає числа", subtraction, "- subtraction віднімає числа", multiplication, "* multiplication множить числа", division, "/ ділить числа",  floor_division, " // повертає ціле число після ділення", remainder, "% повертає залишок після ділення", exponent, "** зводить у ступінь")

"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
π = 3.14159
area = π * (7.5 ** 2)
print ("площа кола =", area)
"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
remainder_50 = 50 % 7
remainder_33 = 33 % 7
remainder_14 = 14 % 7
print (remainder_50, remainder_33, remainder_14)

"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea_area = 436402
azov_sea_area = 37800
total_sea_area = black_sea_area + azov_sea_area 
print (total_sea_area, "km2")
"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
full_name = "Паховський Ігор Дмитрович"
print("Перший символ:", full_name[0])
print("Останній символ:", full_name[-1])
print("Довжина рядка:", len(full_name))

"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
text = "Would you tell me, please, which way I ought to go from here?"
print("Перші 6 символів:", text[:6])
print("Останні 11 символів:", text[-11:])


"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
quoute = """Don't have
a favorite
quoute"""
print (quoute)

"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
string_1 = "Hello"
string_2 = "World"
result_space = string_1 + " " + string_2
print (result_space)
result_coma = f"{string_1}, {string_2}"
print (result_coma)
result_new_line = string_1 + "\n" + string_2
print (result_new_line)

"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
# код вводити тут

"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
name = input("Введіть ваше ім'я: ")
age = input("Введіть ваш вік: ")

print(f"Привіт, {name}! Тобі {age} років.")

"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
total_photos = 232
max_photos_per_page = 8
page_count = (total_photos // max_photos_per_page)
print (page_count)

"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
color = input("Який ваш улюблений колір: ")
number = input("Яке ваше улюблене число: ")

print(f"Ваш улюблений колір: {color}! Ваше улюблене число: {number} .")


"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
total_sum = 375291
warehouse_1_2 = 250449
warehouse_2_3 = 222950
warehouse_1 = total_sum - warehouse_2_3
warehouse_3 = total_sum - warehouse_1_2
warehouse_2 = total_sum - (warehouse_1 + warehouse_3)
print(warehouse_1, warehouse_2, warehouse_3)


"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
duration = 18
cost_per_month = 1179
total_price = cost_per_month * duration
print (total_price)
